app/controllers/user_products_controller.rb

  def index
    @user_products = UserProduct.all
---
SELECT "user_products".* FROM "user_products"